In [8]:
import pandas as pd 

# dataset_1
dataset_1 = pd.DataFrame({
    "Name"  : ['yash','tanya','tushi','mohit'],
    "age"   : [21,20,18,25],   # keep numbers, not strings
    "salary":[100000,10000,20000,150],
    "work"  : ['data science','sales executive','accounted','swiper']
})

# dataset_2
dataset_2 = pd.DataFrame({
    "Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
    "age"   : [21,23,20,18,25,26,45,22,30],
    "salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
    "work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
               'maneger','bank maneger','scientest']   
})

# merging the two data set 
df = pd.merge(dataset_1, dataset_2, on='age', how="inner")
# inner functuion sowing only common data in the both data set 

print("Inner Join function in the merging :-")
print(df)

Inner Join function in the merging :-
  Name_x  age  salary_x           work_x Name_y  salary_y           work_y
0   yash   21    100000     data science   yash    101000     data science
1  tanya   20     10000  sales executive  tanya     10000  sales executive
2  tushi   18     20000        accounted  tushi     20000        accounted
3  mohit   25       150           swiper  mohit       150           swiper

# they showing m*n = data 
* cross joint
* where m is ds1 or n is ds2

In [17]:
dataset_1 = pd.DataFrame({
    "Name"  : ['yash','tanya','tushi','mohit'],
    "age"   : [21,20,18,25],   # keep numbers, not strings
    "salary":[100000,10000,20000,150],
    "work"  : ['data science','sales executive','accounted','swiper']
})

# dataset_2
dataset_2 = pd.DataFrame({
    "Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
    "age"   : [21,23,20,18,25,26,45,22,30],
    "salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
    "work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
               'maneger','bank maneger','scientest']   
})
df = pd.merge(dataset_1,dataset_2, how = "cross")
print(df)

   Name_x  age_x  salary_x           work_x        Name_y  age_y  salary_y                work_y
0    yash     21    100000     data science          yash     21    101000          data science
1    yash     21    100000     data science  yash vardhan     23    100000          data analyst
2    yash     21    100000     data science         tanya     20     10000       sales executive
3    yash     21    100000     data science         tushi     18     20000             accounted
4    yash     21    100000     data science         mohit     25       150                swiper
5    yash     21    100000     data science          monu     26     12000  hardware Engineering
6    yash     21    100000     data science      shinchan     45     15000               maneger
7    yash     21    100000     data science       nobitha     22     25000          bank maneger
8    yash     21    100000     data science      doremone     30     30000             scientest
9   tanya     20     10000  sales executive          yash     21    101000          data science
10  tanya     20     10000  sales executive  yash vardhan     23    100000          data analyst
11  tanya     20     10000  sales executive         tanya     20     10000       sales executive
12  tanya     20     10000  sales executive         tushi     18     20000             accounted
13  tanya     20     10000  sales executive         mohit     25       150                swiper
14  tanya     20     10000  sales executive          monu     26     12000  hardware Engineering
15  tanya     20     10000  sales executive      shinchan     45     15000               maneger
16  tanya     20     10000  sales executive       nobitha     22     25000          bank maneger
17  tanya     20     10000  sales executive      doremone     30     30000             scientest
18  tushi     18     20000        accounted          yash     21    101000          data science
19  tushi     18     20000        accounted  yash vardhan     23    100000          data analyst
20  tushi     18     20000        accounted         tanya     20     10000       sales executive
21  tushi     18     20000        accounted         tushi     18     20000             accounted
22  tushi     18     20000        accounted         mohit     25       150                swiper
23  tushi     18     20000        accounted          monu     26     12000  hardware Engineering
24  tushi     18     20000        accounted      shinchan     45     15000               maneger
25  tushi     18     20000        accounted       nobitha     22     25000          bank maneger
26  tushi     18     20000        accounted      doremone     30     30000             scientest
27  mohit     25       150           swiper          yash     21    101000          data science
28  mohit     25       150           swiper  yash vardhan     23    100000          data analyst
29  mohit     25       150           swiper         tanya     20     10000       sales executive
30  mohit     25       150           swiper         tushi     18     20000             accounted
31  mohit     25       150           swiper         mohit     25       150                swiper
32  mohit     25       150           swiper          monu     26     12000  hardware Engineering
33  mohit     25       150           swiper      shinchan     45     15000               maneger
34  mohit     25       150           swiper       nobitha     22     25000          bank maneger
35  mohit     25       150           swiper      doremone     30     30000             scientest